{"url": "https://www.reddit.com/r/iphone/comments/53ezht/went_from_an_iphone_6s_plus_to_an_iphone_7_chose/", "post_title": "went_from_an_iphone_6s_plus_to_an_iphone_7_chose", "post_content": "Wondering...did everyone who went for the 7 Plus, from the 6 or 6s, do it because of the dual camera lens on the back? I had the 6 Plus for 2 years and really didn't mind it, but felt the smaller screen was more practical.  Just looking for insight!\n\nThanks!", "post_comments": ["Went from 6 Plus (Had for 2 years) to 7, and I'm in the same boat. The comfort of the phone in my hand is amazing now and it feels like I have just a phone again, not a tablet/phone hybrid.\n\nIt might be different for some, but I'm glad the Plus' features weren't necessary in my daily use.", "I just returned my 7 for an SE. Crazy I know but I need to be able to touch the entire screen with my small hands. ", "I had the original 6+ for a year, thought it was too big, went to a 6s for the last year and regretted it after the first couple months, and went with the 7+, which I've had since Friday. It is certainly a personal preference, but I missed the larger screen and am glad to be back with the plus.", "I went from a 6+, to a 6s, to a 6s+, to a 7+. \n\nI love the one handed use of the smaller form factor but that battery life is a deal breaker for me. I wound up swapping my 6s for the 6s+ with a guy on craigslist and I didn't regret it. ", "I'm so glad to hear you like your decision. I have 6+, should have my regular 7 tomorrow. I picked my old 5 a month ago and knew I needed to downsize this time around. \n\nBut I am bummed about the lower ppi. It's backwards! The smaller phone should have the higher ppi since, theoretically, I have to hold it closer to my face. \n\nAlso, I know space plays into it, but the smaller phone shouldn't be the \"cheaper\" version. It should get the premium features as well. ", "Use to have a 6+, then went to a normal 6s, and then got a normal 7", "deleted  ^^^^^^^^^^^^^^^^0.6540  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/90473)", "I went from the iPhone 6 Plus to iPhone 7 and I don't regret it. I have the apple smart battery case and I'm so happy with the feel of it. That's why I like having the smaller phone because when you put a bulky case on it, it's still pretty sleek. ", "I went 6 to 6s+ to 7+. I'm amazed at how light the smaller phones are, but for me the larger screen, better battery, and premium features like the camera and more powerful hardware have made me never look back from upgrading to the bigger size.\n\nAlso, the size is totally relative I think. The pluses used to feel huge until I got one, and now they feel normal and its the regular size that seems tiny.", "I went from the 5 to the 6 Plus and loved it. I have abnormally large hands, being 6'6\" with a size 16 shoe, phones have always been a little small for me. My wife has a 6 and it's just so small, I have no problem using the Plus with one hand and to me I like having a bigger screen as well. I don't think I'll ever go back to a smaller screen. ", "I have big hands, not abnormally big but I don't think I could ever go without a plus model.", "The 7 Plus in the SKU I preordered at Target won't be available until October.\nSo I bought a 7 at the Apple store with the intention to return it within 14 days. \n\nSo far I like the size a lot for 1 handed use, but the specs on the 7 Plus are so tempting. I'm worried I'll just a phone that's uncomfortable to use because I'm a specs whore.\n\nI've heard you get used to phablets eventually though. ", "I've always used the smaller version of the phones. I love my 6 and am getting a 7 next week. My reasoning is I have dainty hands. A smaller phone just feels right. The + makes me feel like I'm holding a little TV.", "Currently an owner of the iPhone 6S Plus. \n\nAlthough I will admit sometimes it can be annoying & uncomfortable to hold like while laying down at night, I love the larger screen & the battery life. \n\nThough it can be annoying as I've stated above, I cannot see myself ever going back to the smaller iPhone(s).", "I prefer the larger screen. Had a 6s+ and now 7+", "I had the 6+ when it came out, got the 6S Plus last year when it came out but this year I dropped down to the regular size 7 also, don't regret it at all either. \n\nPicked up the Apple battery case either, now my battery is far better than the Plus ever was.", "I went from a 6+, to a 6s, to a 7+ almost solely for the dual camera. I am enjoying the bigger size and better life as well though. ", "Had the 6+, got the 6s, skipping the 7/7+ and going with the + version of next year's phone. I chose storage space over screen size and battery with the 6s. Now that the base is 32GB I'm going back to the +. I'd go with the 7+ but since my screen is cracked, I'd need to pay $175 to get it fixed before I can Jump with T-Mobile.", "I finally plunged into the + realm yesterday with my 7. I've been fighting going larger for a long time as I really thought I liked the compact size especially when I always throw my phone in my jeans. However, I recently changed jobs and my new job requires me to view a lot of excel heavy emails which were a pain to view on my 6. So I nervously gave the 7+ a shot. I have to say, I really love it. The biggest thing noticed is that I no longer mistype. I guess being 6'4 I have pretty large hands so I would always miss hit keys I ruled it off to the touch screen. But with the + problem solved. Will have to test out the battery and such but I think this phone size is better for my size. Wish I hadn't been a fool and jumped on the + bandwagon years ago. ", "Went from 6s Plus to SE and don't regret it at all. The advantage of holding and using the phone with one hand is just awesome. \nNo more feeling of being \"ruled by my phone\" since I'm using it much less after I downgraded.\n\nOnly thing I'm missing here and there is the front camera, but I'm not a big selfie-kind of person so it doesn't matter most of the times. :)\n", "I went from a 6>6 Plus>6S>SE. Recently I had to fix something on someones 6S Plus and I remembered how much I missed having a huge screen. \n\nIn a perfect world I would have the SE, 7 and 7 Plus all sync'd together so depending on what I was doing for the day I could grab the phone best suited for it.\n\nI guarantee after I have the 7 Plus for a few months I will in certain situations miss the smaller SE. ", "I find that anything bigger than a 5s is unusable for anyone who doesn’t have huge hands. The only exception, thus why I have a 6s, is if you use onehandwizard. Such a necessary tweak.", "I went from an ZF2 (5.5\") to 5S because it literally injured my hand (I'm having to do physical therapy) due to big screen and weight. \n\nI chose 5S instead of SE because at my country SE costs like R$2500 (more than 3 minimum salary) and 5S costs *only* R$1300 if you get a good second handed one ", "I'm on a 6s plus. Tried the 7 in store. It felt smaller than my iPhone 5 somehow. ", "Exactly the reason I also downsized. Wanted my phone to feel like a phone again", "Hey o/ what about battery life you have on your 7 ?", "We are both crazy then.  I just wanted the small footprint again.", "I did the same thing with my 6S as soon as the SE came out. One handed operation cannot be understated as a feature", "This just shows how subjective this stuff is and I'm glad that Apple still offers phones at all these sizes.  I picked up an SE the other day and played with it and I couldn't believe I ever used a phone that small.  I'm sure people look at me with the 7 plus to my ear and think I look like an idiot talking into an ipad. ", "[deleted]", "[deleted]", "can't wait to get back into my plus. did the same as you. miss the battery life and screen real estate", "What about the battery? I am thinking to go for a 7/7+ from my current 6+ and I'm not sure which one I should choose. I absolutely love the battery of the 6+.", "Dat feel when you can actually use your phone throughout the day", "I went from plus to regular 7 and the screen resolution is one of the first things i noticed. \n\nDebating about exchanging :-/", "That is sort of the first thing I said today! I picked mine up today from the local Verizon (didn't even pre-order, I called them, and they said they had one left...and it just so happened to be the EXACT one I wanted....divine Apple intervention?), took it out of the box and was like...oh...this is...tiny?\n\nBut I don't entirely hate it. I kind of enjoy the smaller mobility, but it's an adjustment.  I've just always found the Plus to be too bulky for me, despite being 6'4'' and having GIANT hands..but it's an interesting take on the whole thing. Thank you!", "I too went from a ZenFone 2 (mine was the laser version) to the iPhone 5s.  Bought the 5s because the ZenFone crapped out on me the day I was traveling with my son to our vacation.  I love having the smaller screen.  I missed being able to use my phone one handed.  (It's also faster then my ZenFone 2)", "Well if you compare 7 to 7+ clearly the 7+ will have more juice,  but personally I don't feel affected. My 7 has lasted an entire 9 hour work day + heavy reddit browsing when I lay down before I have to charge it.\n\nThis all on 100% brightness. I can probably milk a whole hour or two with 50%,\n\nI strongly urge getting the Apple Battery Case if you can spare the premium or need that extra juice. They have a nice grip, cup your speakers better (louder), and give your phone a solid 2 days lifespan before charging.\n\nBasically a negligible battery difference between 7 and Plus, recommend battery case if you want that extra power consumption if you're a heavy user.", "That only works if youre trying to touch something up top. I have trouble hitting the top left of the keyboard. Having to double tap the home everytime also gets very tiresome when you have to do it constantly. ", "I have been torn over getting a regular size 7 or plus for the past 2 weeks and I still cannot decide for the life of me. I want the bigger battery and dual cameras but I wear almost entirely skinny jeans and I don't think I'll be able to fit the phone in my pocket without snapping it in half or looking like I'm carrying a tablet in my pocket. Also one handed use is something I do a lot so the smaller screen is nice. Ugh, so hard to decide.", "I currently have a 6s+, insane battery life, I'm playing some games here and now and mostly browse Web like reddit and I have like 40 or 50 % at the end of the day \n\nI'm just a bit afraid about having not a lot of battery life if I go with the 7 ( can't stand the size of the 6s+ any longer) ", "Same. I have both the 7 and 7 plus so I can decide for myself. I had the 6 plus, which I hated due to the size/weight, then the regular 6.\n\nI just don't know where to put the 7 plus when I'm done using it while walking down the street. I'd just side the 6 in my jacket pocket. Do people just clutch the bigger iPhone in their hands constantly?  ", "It definitely is bigger in the pocket, I wear a suit most days to work and its fine in a jacket pocket.  The battery is absolutely worth the size IMO.", "Trust me, you will not be using the dual camera much. And the way the cameras are optimized, the second lens won't even trigger unless you are in perfect lighting and using only the 2x zoom. The iPhone 7 battery definitely doesn't last longer than the plus but it is a significant upgrade from the 6s and gets me through the whole day unless I'm streaming mass YouTube videos or playing games. On the brighter side, the iPhone 7 charges much quicker than the plus if you need a quick top off.\n\nEdit: I'm like you in that I wear skinny jeans and in a lot of situations where I need one hand operation in a phone. It really is an underrated benefit. The 4.7 inch screen I feel is that sweet spot as well. It's just big enough for good media consumption, gaming, and doing normal smartphone stuff. ", "Get the smart battery case and it will last longer then the plus models. ", "Basically in the same position as you. I really want the one-handed use as well as fitting in my skinny jeans. I've used the Plus in Apple Stores and think it'll be a nice improvement? I've only ever owned the non-Plus models, but I went with the 7 Plus this year. I should be receiving it in a week and worst case scenario, I'll return it for a 7 (although hopefully not).", "Okay so I've used the Nexus 6p for 4 months after selling, it never bent in my pocket (I wear regular jeans. No skinny jeans but neither baggy). This phone is known as being very prone to bending.\n\nThe iPhone has been a very, very solid phone for a while now and will most definitely not bend in your pocket. One-handed use for iPhones is fine when using the double-tap-homebutton feature thing where it slides down the screen for you to hit buttons up high.", "Like, the battery difference is going to hover around 10%. It's a difference, but not a lifestyle change to be honest."]}