{"url": "https://www.reddit.com/r/apple/comments/g7rtsz/iphone_se_2020_vs_iphone_7_should_you_upgrade/", "post_title": "iphone_se_2020_vs_iphone_7_should_you_upgrade", "post_content": "", "post_comments": ["This is targeted at me specifically\n\nEdit: thank you all for the upvotes", "I have the 6s and just ordered an SE. main reason is because my battery dies pretty quickly.  Like a couple hours.  Did I make a mistake?", "Ask yourself, what does it do that your current phone doesn't do?  Are these \"new\" features or performance something you will feel is worth the cost, or are you better off waiting until there is a better value to be had.\n\nI'm currently running an iPhone 6 that I've replaced the battery on twice myself. It works great. Although the new SE would be a substantial improvement overall, it's just not necessary (plus I'd be losing the headphone jack). I'm willing to keep using my current phone for at least another year.  But if my phone stopped working, I might seriously consider buying an SE rather than investing in repairing a phone that won't even run the latest iOS.\n\nThe iPhone 7 still has at least another year of relevancy.", "I have a 7+ and want to upgrade. But at the same time I’m not sure how I’ll handle the decrease in size. I’m just going to wait till this virus is done then play with them at the store.", "I'll wait for another year I guess.", "Small thing I found when updating from the iPhone 8: the SE doesn't let you expand notifications with a long press. On a 7 and 8 you can 3D Touch them, but Apple removed this on the SE *and* disabled haptic touch for notifications specifically for some reason. (On X style iPhones, you can use haptic touch to expand)", "If this helps, I am using the SE next to an X and outside of the screen it destroys the X in all other aspects. Specifically the camera and network speeds.", "Uh yes why not? 2020 specs?? With an updated body... I'd say go for it.", "To me, if you’re in the market, an SE now is a good time. It’s not likely to go down in price, and will probably stick for 3-4 years. r", "The battery on my 7 is shot. Honestly, I don't want a new phone. I'd rather wait for the 12 and go to 5G (I assume) to get some more years out of it. \n\nThat being said...\n\nI do not like FaceID at all.\n\nAdd to that the fact that all the Apple Stores are closed and the nearest one is a long way away on trains I don't want to be on and...\n\nI just don't know.", "> The base model of the iPhone SE features double the storage of the paltry **32MB** that the iPhone 7 offered.\n\nhmmm", "I have a 7 and I was really excited for the iphone SE since it’s got a home button with touch ID instead of swiping up and also not and ugly fidget spinner for a camera but now I found out that even the white version has a black front and that actually makes me hesitate. I don’t want a phone with 2 colors. also sad that they killed rose gold and gold 😒", "I only had my iPhone 7 for around 2 years (not the 3.5 years since its release) so I thought about not upgrading for another year. Battery life at 83%. However, as someone else mentioned, I may not get that $120 trade-in by next year (I don't know how long they will accept trade-ins for) so I figures why not. Plus I am buying the color red that supposedly is going towards COVID-19 relief, so that's another plus.\n\n&#x200B;\n\nHopefully I keep the SE 2020 for at least 3 years then since it's a nice upgrade.", "I would have upgraded if the design was more modern.\n\nI don't want those huge bezels 5 years again.\n\nSo i'll keep my iPhone 7.", "If you’re using a 7 and actually utilize your phone a lot, I’d say an 11 is worth it. Bigger screen, two cameras, but most importantly is the battery life. iPhone 7 traded in brings the 128Gb 11 down to $649 or something.", "I have a iPhone 8 \nShould I buy iPhone se 2020", "I hope the company I work for upgrades. We all have either 6 or 7 with very heavy GPS use, heavy email & text, and moderate calls and third party app uses. I have to charge my phone numerous times a day.", "Nice iphone. I can’t see a AUD 1k upgrade as necessary or even desirable. A few photo enhancements and maybe somewhat faster opening apps. I’m good to date. \nI’ll await iPhone 12S in 18 months. That’s likely THE ONLY worthy upgrade from my workhorse iPhone 7 128.", "Every time you buy a new iPhone it’s an “upgrade” when it comes to battery. It’s simply because the battery isn’t as old. Sure there might be improvement, but EVERY phone’s battery starts to decline after a year or two.", "I will not upgrade from my SE 1.  I will no longer willingly support those communist fucks in China.", "Yup...my mind was already made up though. Better processor, more RAM, wireless charging, better photo processing, True Tone. All those are worth the price of upgrading PLUS the future-proofing.", "See my other post on this thread, I did this.", "I got the iPhone 7 Plus and I unfortunately can’t go back to such a small screen (for my hands)", "Good for you.", "I got my SE in yesterday to replace my 6s that was on its second battery. My 6s would usually have died by now but I’m only down to 70% after like 7ish hours? It’s insane how much I got used to a battery being dead by noon most days.", "I got 5.5 hours of screen on time today with my new SE doing light tasks like texting and web browsing primarily. Lasted from 6 am to 10 pm without a charge. \n\n\nhttps://imgur.com/3fQj6QX", "I think Apple will still replace the 6S battery cheaply, or possibly free in your case.", "Using it right now. Came from an iPhone 6 Plus model and it’s such a upgrade. Being able to use dark mode without a jailbreak is fucking amazing. The battery life isn’t too impressive, but if you were still running a 6s, you’d see improvement.", "You did not make a mistake! SE is an amazing phone!", "Nope. I’ve just finished setting up mine, and it feels almost like my old phone, but way faster and  minus 3D touch. I miss the force touch gestures a lot, but I’m sure a few months down the line it won’t matter anymore. No regrets!\n\nPlus, the 256GB SE is cheaper than my 128GB  6s when I bought it, and it was nearly 2 generations old back then.", "Hey I just got mine today and you won’t be disappointed with battery life. It’s so much faster and my battery lasts me all day IF I’m on it. I’m sure you’ll be happy.", "I doubt I’ll still get $120 trade in value for my 7 if I wait. But I can deal with another year of 7.\n\nEdit: but I really want an SE now.", "I made this hop specifically.  A couple of quick differences: the battery life is much improved over the 7, the network and WiFi connection are MUCH better, and even a Reddit example- if I switched away from Apollo or Slide, the 7 would have to reload the app losing my place. The SE is handling app switching much better.", "Ask yourself, not what your phone can do for you, but what you can do for your phone.", "Seriously, it’s been almost 4 years since the death of the headphone jack, you people needa let it go. But seriously, the SE is a worthwhile upgrade. You want your phone to last? Get an SE. I’ve used the iPhone 6 for a couple of days as my daily driver back when school was a thing, and that thing couldn’t handle ANYTHING i threw at it.", "But to use your own criterion: what does the latest iOS do that your current version of iOS cannot do?", "I went from the 6 to the X, and the quality of life improvement just from the speed was enough to make it worth it to me. The 6 was frankly underpowered to begin with. \n\nBut yeah, of course that’s something you have to judge for yourself, whether it’s worth it or not.", "my thoughts exactly. i dont see myself having a different experience with the SE over the 7. if the SE had night mode though, I would be typing this reply from that.", "You get used to it, but not after playing with it at the store. The screen was always big enough, but people just want to watch Netflix on their phones now so the screens have gotten bigger for that.", "7 plus is still a capable device. Same RAM, bigger battery and screen. Just lack in a newer processor", "[deleted]", "Does the new se use Qualcomm?", "Just my reasoning in upgrading my wife", "Because it costs hundreds of dollars, and might not do anything your old one couldn't.  Do you also buy a new car every 3 years, because the new model has an updated styling, and is slightly faster?\n\nThere's an opportunity cost to everything.  Put that $400 in your 401k instead and it'll be worth over $100,000 at retirement.", "I bought my ex the iphone 7 at the time, and im so glad she is stuck with 32gb. haha", "[deleted]", "Good luck buying anything at all. Nearly all electronics are made with components made in China.", "Your SE1 came from China.\n\nAs probably did your computer, your tv, parts made in your car, your kitchen appliances...", "Good luck buying things where no part of them was made in China.", "And better LTE!", "damn what you even do 😢", "Awesome!", "Wow that battery life is amazing. Given the SE’s small battery, I wouldn’t think the battery would last that long. I suppose it’s due to the A13 Bionic chip.", "Okay that's promising. I was hearing 3.5-4.5 and want super impressed. 5.5 is very promising. I don't game either, so I should be in the higher end. Can't wait for the upgrade from my Pixel 2 that's getting about 2.5 hours of screen on time at the moment. Mine arrives Wednesday!", "$49 dollars out of warranty plus tax. There is a repair program for certain models of 6s though for unexpected shutdowns.", "Meh I don’t want a new battery", "If you want an iPhone and don’t want to spend over 700$ don’t wait and go take that phone, you won’t have any better offer till a long time", "I’m in the same boat as you.", ">Edit: but I really want an SE now.\n\nIts is basically the same phone...... better go for an XS or 11 Pro if you want some real substantial improvement.", "Just do it!", "iPhone 6s here and I switch between Apollo and twitter/insta/snap a lot and it’s almost NEVER been able to keep them open. Mind boggling they made 2gb devices up to the 8 and even just 3gb on the SE. I suspect In another 2 years the same will apply to 3gb devices...", ">\tBattery life\n\nHow much of an improvement are you noticing? I’m on the 7 right now, and I’m concerned about how much of an upgrade the SE would be. Also, how was your iPhone 7 battery health?", "There comes a time when apps can't be updated (to fix bugs) until a newer OS is installed.  I usually delay installing OS updates as long as possible to allow the early problems to be worked out. Eventually having software that is too out of date causes other problems. So while I don't demand being on the bleeding edge, I do try to run software that is still well supported.  It is rare that I update to just to gain new features.", "What apps ran too slow on the 6, or was it just the speed of opening and switching that was problematic?", "Ya I think I just need to buy a new battery honestly. Will be a much cheaper ‘upgrade’.", "i always thought my x camera was shit too!", "The X has never felt slow to me, but like you said the camera is dog shit.  The SE just has a little more zip to it, and I’m sure when IOS 14 lands the speed difference may be more noticeable.  If the screen is a non factor, everything about the SE is better. It’s also taking me a minute to adjust to a home button. I keep swiping up from the bottom to go home.  The form factor is really nice. One handed use is way better, and the X feels like a brick when I switch back.  The battery seems like it’s going to be much better than the Apple website states.", "How can I check?", "I think your math is a little optimistic on that one chief haha", "> Put that $400 in your 401k instead and it'll be worth over $100,000 at retirement.\n\nHah!\n\nNo. Not even close. It wouldn't have even gone there for my grandma who made all her investment money in the 80s (from her kindergarten teacher's salary; my grandpa died very early). For me, in my 40s, who saves/invests about half of what I make, with a very diverse portfolio, I'm seeing well, well, well below 10%, which is supposedly the base rate of the stock market itself. \n\nEverything we've been told about this is a lie. The only way that you make interest is if there's growth. There cannot be infinite growth, and most of the US/West \"growth\" has been fictitious. It's been central banks filling the Iraq War and 2008 holes with fake money, which goes to the banks, who buy stocks and lend money to corporations who use it to buy their own stocks. This all works together to make the stock market go up *with no real change to the economy.* It's all a show.\n\nEnter COVID, and I think the wheels are going to come off. It has become clear that the economy cannot take a downturn at all without central banks just saying, \"Uhhh.... Let's just pretend we didn't see that and add a few more zeroes... There; all better.\" \n\nThis is going to start killing off non-USD currencies because all currencies are worthless, but the USD is the least worthless. Expect the dollar to surge, but then it will succumb to its own inflation. This will result in debt deflation and ultimately insolvency.\n\nBitcoin and gold.\n\nThey aren't really investments; we're hoping they're just safe havens. \n\nShit's going to get bad.\n\nMy advice would be to buy a phone now because you might not have a job next year, and will be stuck with whatever you happened to have when you lost it.\n\n...Which is why I'm thinking of getting an SE now.\n\nSeriously.", "But I do change my car every 2 years...", "But would that have the same issue with SE regarding battery life just because of it’s size?", "Not for long. The only silver lining I see to any of this is that people will see what a liability dealing with China really is.", "[deleted]", "Why ask a question if you don’t want an answer?", "Depends on what you're looking for.  You can buy an unlocked, manufacturer-refurbished iPhone 8 from third-party sellers online for $200, or an iPhone 7 for $100.  Unless you need an A13, those are a tremendous value.", "It’s the battery too. I went from a 6s to 8 (both 2gb ram) but on the 6s my battery was shot to hell and suddenly my phone could keep many apps open for a lot longer.", "[deleted]", "My 7 was at 85 percent battery health. Overnight it would lose about 15+percent battery just idling in about 6-7 hours. An hour on Reddit could take 10 to 20 percent.  Games like Altos odyssey would noticeably warm up the 7. I’m trying to stick to similar habits to make sure it’s a consistent improvement I’m seeing. I was averaging about 5 hours of screen on time daily with spot charges when I had opportunity.", "Just doing anything really. The best way I can describe it, is that with the 6 I was constantly waiting for the phone to catch up. With the X, that feeling went away. And with the amount of hours I spend on my phone each day, that was worth the upgrade in itself.", "When I swapped the battery in my old 7 Plus for a new one, performance and battery life went back to normal again. It's like I had a brand new phone again.", "It would be less than $80 if you’re in the US", "[deleted]", "Then you are a fool.", "Get ready to pay a lot more for everything of that happens. \n\nThe market is louder than any politic.", "I get that, but buying electronics from elsewhere or at least with internal components from China really isn’t that easy.", "The right carrier deal can get you the iPhone SE for $200 too!", "I currently have about 3 hours of screen time (it does 24 hours and it looks like about 1:15 of 4:15 was yesterday) since my last charge with 8-9 hours of double speed Bluetooth audio playback and am at 60%. I haven’t done any 3D stuff yet today though.", "Your battery must be shot. You probably need to replace your battery after this is all over. Now I know you said 97%, it is not a good indicator to replace at 80% honestly, just go replace them whenever you felt the battery life is significantly less than what it should've been. Mine got about 6 hours of screen-on time (10-day average, 89% health). Or maybe try a full iOS reinstall, it might help a bit, although unlikely", "Happy cake day my friend,  \n\n\nI'm considering jumping from 7 to 11 pro, have been eyeing it for months now, but the 7 still works great... Might as well wait those 5 months for the 12 release and see what happens. Quality of life improvements are tempting though.", "Did you get Apple to do it or did you just buy one off amazon?", "haha yeah i got sucked in by all the praise it got. I will stick with apple now though as i do like the software experience. Just the camera didnt live up to all the hype in my opinion. I will upgrade eventually but i need to get my money worth out of this phone first, so would like to hold onto it for at least 4 years. I will just live with the shit quality. The video quality is decent though.", "Ha okay.", "AT&T was showing me $5 a month for 30 months for new signups or new additional lines. So $150.", "[deleted]", "I replaced mine from Apple directly. Had to pay 49$ for it.", "Yeah. Like I said nothing 3D, that’s casual browsing type behavior at work. But Bluetooth seems to be pretty efficient and I mentioned the speed because that seemed to cause issues on the 3a for me."]}