{"url": "https://www.reddit.com/r/Sprint/comments/9nyk56/extended_ltenonlte_iphone_7_plus_vs_lg_g7_thinq/", "post_title": "extended_ltenonlte_iphone_7_plus_vs_lg_g7_thinq", "post_content": "I have an iPhone 7 Plus (not tied to any carrier) and am considering the Sprint offer of free service for a year.  \n\nThe issue is that it shows lots of Extended non-LTE in my area for my phone, but when I select the option to show coverage for a different phone (G7 ThinQ, for example), much of that Extended non-LTE coverage becomes Extended LTE coverage.  \n\nI looked at the specs for each phone ([https://www.lg.com/us/cell-phones/lg-LGG710PM-g7-thinq-sprint](https://www.lg.com/us/cell-phones/lg-LGG710PM-g7-thinq-sprint) and [https://www.apple.com/iphone-7/specs/](https://www.apple.com/iphone-7/specs/)) both appear to show compatibility with the same LTE bands.  What is it that I'm overlooking that would explain why the LG would get so much more extended LTE coverage than my iPhone?", "post_comments": ["Your location maybe helpful to someone trying to answer the question. ", "I’ve wondered this myself. When using android in my area (Arkansas) Verizon shows up as roaming and counts against the roaming limit. I swapped my android for an iPhone it shows up as 3G extended but data doesn’t work very well. Nothing like my Verizon phone on 3G. Depending on your area it could be US Cellular territory. I’ve seen both LTE and 3G from them when i go back to Missouri. I haven’t figure out what the trick is though. As good as their network is I feel like it should just switch to LTE. Either way you have a great question. I wish I knew the answer.", "\nHave questions on phone compatibility or bringing your current phone to Sprint? See Sprint's **[Bring Your Own Phone](http://www.sprint.com/landings/bring-your-own-phone/)** page for a list of eligible devices and for how to purchase a **SIM kit**. For certain devices, you may have to request your ESN be added via DNA2 or a ClickIt Ticket at a Retail Store. Also see the **[Wiki](https://www.reddit.com/r/Sprint/wiki/index#wiki_switching_to_sprint/)**.\n\n**Note: Sprint's system does *not* use IMEIs, it uses the device MEID. This is usually the IMEI without the last digit.** If you are encountering an error when trying to use an IMEI, remove the last digit. This is the basis of *a lot* of \"errors\" people seem to be getting. ***There is no error.*** You're trying to use the wrong device identifier. An IMEI is 15 digits long, but an MEID is only 14 digits.\n\nNote, you will *not* experience full speeds/coverage when using devices which lack full LTE Band support, Carrier Aggregation support or HPUE support on Sprint. For reference, Sprint utilizes LTE Bands 25, 26, and 41.\n\nDo you have a new compatible device you want to swap to? **[Activate it here](http://www.sprint.com/landings/howtoactivate/index.html)**.\n\nThe **[My Sprint](https://www.sprint.com/landings/my-sprint-mobile/index.html)** App is available for **[iOS Devices on the App Store](https://appsto.re/us/c0FrD.i)** and for **[Android Devices on Google Play](https://play.google.com/store/apps/details?id=com.sprint.care)**. Report speed/coverage issues and manage your account. \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Sprint) if you have any questions or concerns.*", "[deleted]", "For example, an iPhone 7 Plus shows a lot of Extended non-LTE in the area of  Brownsville, KY.  The ThinQ shows as having a lot of Extended LTE in the same area.  \n\nThere is no native Verizon coverage in the area.  There is occasionally TMO/ATT LTE coverage in some parts of the area but virtually none in the areas that are shown as \"Extended LTE\" on the Sprint map.  \n\n&#x200B;\n\nIs there a reason why Sprint provides the  ThinQ with Extended LTE coverage, but not the iPhone?", "My area has no native VZW coverage."]}