{"url": "https://www.reddit.com/r/afkarena/comments/kyfmqy/suggested_phone_specs/", "post_title": "suggested_phone_specs", "post_content": "I got a new phone not too long ago (moto g power) which i expected would have no issues playing the game but it definitely doesn't play smoothly. Well i recently shattered my phone and it is no longer usable just wondering what the minimum specs for a flawless experience would be. thanks", "post_comments": ["I think any new phone would do fine. Using a 5 year old iPhone 6s running the game without much issues other than the occasional loading screen after repeating stage dozens of times...", "Im currently using phone with snapdragon 732. Played it smoothly, but after heavy retries and several kt floors, the game lags. Have to restart the game to make it smooth again. Minions makes my phone a bit lag too.\n\nMy previous phone, with snapdragon 625, lag like no tomorrow. Didnt know how can i play using that phone. I factory reset the phone, and leave afk arena the only game in there, lag is still there.\n\nMy conclusion, the better the processor, the smoother it is for android. For iphone, not really sure.", "So, I use a snapdragon 888, and it runs fine as if the game was nothing, tho it is a high-end phone chip (z flip 3 and used cost like 300-500 dollars)", "https://www.gsmarena.com/xiaomi_mi_10t_lite_5g-10480.php\n\nThis has a very fast soc(system on a chip) for its price. Poco x3 nfc is also pretty good(slightly cheaper, slightly slower, no 5g). Depending on the game, either of these phones can be almost twice as fast as your current one. Here is a comparison between snapdragon 750g(mi 10t lite 5g's soc) and snapdragon 665(your current phone's soc).\n\nhttps://nanoreview.net/en/soc-compare/qualcomm-snapdragon-750g-vs-qualcomm-snapdragon-665\n\nIf you dont care about android and you can pay a bit more, iphone se(2020 version) is insanely fast(faster than literally any android, even flagship android phones). Obviously it has some disadvantages(small screen, ios, etc) but if you only care about performance, iphone se is insane and somewhat cheap.", "Using huawei p20 and no issue", "One thing to consider with the game is space. I’m using an iPhone 6 and the game plays fine, but I have to clear the cache every 1-2 days otherwise it eats up the piddly storage and forces all my other apps off.", "I'm still using a 2015 Samsung A8 phone and it works just fine albeit laggy ingame at crowded screen and when used for a long time but still playable most of the time. Any new phones should be able to do, even the mid range phones these days has decent specs. If my Mali-T628 MP6 and 2GB RAM can run it just fine, most new phones these days should too. I recommend looking for phones with Snapdragon chips tho since they're more focused on games and will less likely to have issues.", "I'm running the game on a OnePlus 3 with LineageOS, if you just disable combat text and a few other things performance is okay even when running all units that summon extras which is the only performance issue really.", "yeah that's why i was surprised. the moto g power came out last year", "i also experienced crisp performance at times and other times it was abysmal with my moto g power (Snapdragon 665 4gb ram)", "> iphone se\n\ni guess the only problem with that would be my account is tied to android", "btw extremely helpful, thank you", "how do we clear cache for afk arena on ios? i’ve been having a lot of issues recently and was looking for a way to clear cache. i’m on se 2016", "Its kinda insane how this game takes up 3gb considering its relatively basic graphics. My 16gb SE 2016 is struggling real hard with ios14 already using 11gb.", "Not every new phone that came out does mean it's good. If you want a solid phone for gaming look around for an iPhone 7 or samsung galaxy 9 or if u don't care about money go for the newest highend  phones. Don't get Huawaii because of the Android ban. That could give you some problems cause of the play store in the future (and login datas) and ofc no cheap china phones.", "You can link your account to facebook.", "To clear the cache, in game go to Settings, Advanced settings, Repair game. It will reload. You can also click Memory in the settings to turn off the AFK animation and Oak Inn hero animations.", "Apple needs to sort their shit out. So hard to clear caches from apps, and reduce the size of  os files/add ability to clear old files / “other” storage etc. Top reason why I will probably replace my phone with non iPhone when this one dies."]}