{"url": "https://www.reddit.com/r/NintendoSwitch/comments/8b3s73/how_powerful_is_the_switch_compared_to_todays/", "post_title": "how_powerful_is_the_switch_compared_to_todays", "post_content": "Been doing research on this and can't get much on comparisons since the Switch is a console and not a tablet. But regardless of what it's classified as, it's insides share home with the tablet family.\n\nSo how does this system compare to today's phones and tablets? Is my Galaxy S8 more powerful?", "post_comments": ["The Switch CPU is pretty far behind smartphones, particularly those from Apple. It's based on the 2014 A57 architecture which was ARM's first stock 64 bit design. There have been three new designs from ARM since then, the A72, A73, and A75. Each generation brought a large increase in performance while also lowering power-draw from the previous. A73 is what went into most 2017 phones using the Snapdragon 835, and now we're seeing A75 in Snapdragon 845 phones. Apple crafts their own custom CPU designs, although still fundamentally based on ARM. The A72/A73/A75 cores used in modern smartphones can offer up to 2-3x performance over the low clocked A57 Nintendo is using, and you can add another 2X on top of those for Apple's chips. So if you have a 2016 phone or beyond, you can expect about 2-3x the CPU performance. There just isn't any competition here, the Switch gets smoked in the CPU department.\n\nThe GPU side of things is a little more forgiving. The Maxwell based GPU inside Tegra X1 was and still is rather unique in the mobile space, as it's the same exact architecture Nvidia uses in their PC gaming cards. The GPU was way ahead of anything else that was available in mobile chips at the time it released in 2015. By 2016 the gap narrowed significantly, and by 2017 most flagship mobile GPUs (Apple A11, Snapdragon 835) had surpassed the Tegra X1 in benchmarks. Nintendo has their Tegra X1 downclocked below the stock speeds nvidia originally shipped it at however, so theres a good chance high end phones in 2015 would've been on par. Either way, while the GPU has been surpassed by modern phones from 2017 and beyond, it's not nearly as far behind as the CPU is.\n\nWe'll still see some good performance from Switch, generally beyond what many phones can do even today, due to the closed nature of the console. Unlike phones, It doesn't have a heavy operating system to manage in the background and can devote the vast majority of it's resources to running games, allowing developers to squeeze out every drop of power in a way they can't do on smartphone/tablet hardware. The Switch also has active cooling via a fan, so developers can expect a completely consistent level of performance 100% of the time while running their software, vs phones which have to throttle their clockspeeds after a few minutes of gameplay due to heat buildup. This throttling can bring you from far-beyond-Switch performance, right on down to Switch-equivalent performance, and potentially down into lower-than-Switch performance depending on the device after just a few minutes. This makes it very hard to push the envelope on mobile devices as you don't have a guaranteed level of performance to work with, and as a result you often have to develop well below the power envelope you initially seem to have. ", "Keep in mind that no matter how much more powerful the phones are, without a dedicated fan to cool them they can't run at peak performance for longer than 5 minutes.", "I'd imagine latest phones / tablets are more powerful on paper, but since it's not a dedicated game console it doesn't take full advantage of power for gaming. \n\nThey cost 2-3x as more than a switch so for that money they better be more \"powerful\"", "Yes, the S8 is more powerful. It might throttle a bit, but I'm not really finding good reviews saying one way or the other. It sounds like the CPU is very stable and doesn't throttle, but of course we need to know about the GPU too and I'm not seeing any good info on that.", "The Switch’s CPU is pretty bad compared to today smartphones and tablets and for the GPU it depends on whether you’re looking at it while docked or not. While docked the Switch’s GPU is about on par with an iPhone 7 and while handheld it’s about on par with an iPhone 6.", "The switch is weaker than all of the current gen high end phones and tablets, its using a slowed down version of the Tegra chip that came out 2 generations ago.\n\nThe thing is that you can't get these same games on iOS or Android so it doesn't matter in the end anyway, but if you're asking could your S8's processor/GPU run Switch games better than the Switch can if it were able to run the Switch OS and the game then the answer is yes.", "In the end it really doesn't matter, because your phone and the Switch are designed to be totally different things. ", "Can your Galaxy S8 run Breath of the Wild or Super Mario Odyssey?", "Raw power wise an ipad pro is more powerful ", "The CPU part, even the PS4 and XBONE have bad CPU's compared to the latest CPU's.\n\nIn terms of Graphics and Memories though, they suck ass. The Switch kicks their asses.\nWhen I see an S8 running Doom and BOTW I will believe. But you will never see that.\n\nPhones/Tablets are overpriced pieces of shit. People are willing to buy 1000$ machines to run Whatsapp and facebook. \nHowever, 300$ for the Switch, and it was called overpriced.", "I'd like to buy a Switch rather than a Galaxy S8 .", "The choice to go for a somewhat dated processor (Nvidia Tegra) was made with being cost competitive in mind. While graphic quality may lack behind current gen tablets, Nintendo banked on a mix of complimentary tech such as gyro, motion, and HD rumble. An interesting business choice for sure", "[removed]", "$1000 vs $300", "Not nearly as powerful as most phones, but also less than half the price.\n\nAlso, in terms of gaming it has better battery life.", "It's a Tegra X1. Yes, your S8 is stronger from a mere raw power perspective.", "are you just wondering or are you trying to decide between a tablet and a switch?", "I was supporting Marblefox. \nAnd I never mentioned that you need a 1000$ phone for the purpose. I was talking about a general purpose computing device which can be of any cost. ", "Is there any doom on android? Nuff said", "Reading this on my Switch.\n\nOh crap, I forgot Nintendo’s latest console can’t browse the web.\n\nI _am_ reading this on my S8, though. Just thought y’all should know.", "Phones and tablets don’t have the same quality or tier of games. It’s likely the iPad Pro is more powerful. I’m sure other top end devices are. Doesn’t matter if the software doesn’t back it up. ", "When are people going to realize the Switch is a game console and not a smartphone?", "I don't really know where it stands when compared with the latest smartphone but If I had to guess I would say the Switch is more powerful.\n\nThe reason I say this is because most phone games look terrible compared to what the Switch has come out with", "Phones and tablets are designed for general purpose use, the Switch is a dedicated gaming device first, and a media device second. As far as power, obviously the more recent hardware will be more powerful than hardware that is a few years old. The Switch is based on Maxwell (750 Ti, and the 800-900 series), and being a mobile device, it's power is comparable to a mobile GeForce 900 series card.\n\n\nAs far as performance is concerned, various tests put it around the one teraflop. By comparison, the XBO, I believe, is 1.6 Teraflops (I believe the Xbox One X is rated at 6 teraflops, but I can't be too sure). Flop in this context refers to how fast it floating point operations can be performed, which is a better measurement of relative performance when compared to clockspeeds. To be frank, I really wouldn't begin worrying until we start seeing games releasing exclusively for the XBO X and PS4 Pro, unless Nintendo does a hardware refresh like they did with the New 3DS. The refreshed Switch, if it does come out this year or next year, will likely be Pascal based, I doubt they'll do Volta. I wouldn't get your hopes up about getting a performance boost like what we saw between the PS4 and PS4 Pro, even though Pascal is extremely efficient, the compact nature of the Switch will make cooling somewhat of a challenge, and there's also the matter of power delivery while on battery.", "Well I can play Doom on my Switch and not on my phone. So. Considerably more powerful. ", "Get wrekt", "This was very interesting to read and well written, thanks a lot.", "Just got off work. This deserves an A+", "plus, one thing to remember is that, while on paper the switch is less powerful than current smartphones, it's also selling at a much lower price. at the moment a galaxy s8 is 600 dollars on amazon\n\n(https://www.amazon.com/Samsung-Galaxy-S8-Unlocked-64GB/dp/B06Y14T5YW/ref=sr_1_1?s=wireless&ie=UTF8&qid=1523368112&sr=1-1&keywords=galaxy+s8)\n\nbut usually selling at over 700 dollars, while the switch is less than half of that at 300 dollars\n\n (https://www.amazon.com/s/ref=nb_sb_noss_2?url=search-alias%3Daps&field-keywords=nintendo+switch)", "Just imagine a snapdragon 845 cooled by a fan inside then! it's gonna be amazing!\n\nI am SUPER hyped for switch 2 or something. Because I know Nvidia is happy with Nintendo and they might also make a new version of tegra specifically for the Nintendo switch!", "So if I have an iPhone X, it theoretically could run games better than the switch?", "Nobody seems to get that most important detail for some reason.", "They're also far smaller and more useful tbh.", "Redmi Note 5 Pro has Snapdragon 636 and it costs 200 bucks. Comparing a closed system of course is pointless because they can optimize it to the fullest but it's a cool indicator how far phones have went.", "So why does docked make the Switch more powerful? Isn't the dock just making it plugged to an outlet and an HDMI source? ", "Not really. The s8 is going to throttle after a few minutes and your going to run into ram issues", "That's pretty much the question at hand.", "Well, it likely could actually. The S8 is already more power than the Stock Tegra X1, let alone an X1 running at the really low clock speeds the one in the Switch runs at.", "Exactly. You’re not paying for ghz you;re paying for “switch” games you simply wont get elsewhere ", "> When I see an S8 running Doom and BOTW I will believe. But you will never see that.\n\nOf course we'll never see that, but that has nothing to do with power, the S8 is more powerful than the Switch, however BotW won't make it to phones because obviously it's a Nintendo exclusive and Doom won't make it because the economics of the mobile market don't make projects like that sustainable.\n\n> Phones/Tablets are overpriced pieces of shit. People are willing to buy 1000$ machines to run Whatsapp and facebook. However, 300$ for the Switch, and it was called overpriced.\n\nIt's all about priorities, my $1000 tablet is a vital professional tool that helps me make more money, my $300 switch, however, just plays games. Some people may be totally okay spending $1000 on something that makes them more money, but not be okay spending $300 on something that won't, and to those people, it's logical for them to conclude the Switch is overpriced.\n\nJust because *you* wouldn't do anything other than whatsapp and facebook on a $1000 tablet doesn't mean everyone only does whatsapp and facebook on $1000 tablets.", "I have both.", "Well, PUBG Mobile looks like shit but runs well, meanwhile the One runs it with better graphics but shit framerate.", "The S8 is $587, not a grand.", "Before getting my switch I did a reasonable amount of gaming on iOS and whilst most titles are Free2Play shit-heaps, there were some decent games.\n\nMy single biggest frustration with mobile gaming though are the controls!  Touch screens are awful, lack feedback and feel disconnected from the gameplay.  Whatever power shortcomings the Switch might have, mobile games will never have as well integrated and optimised physical controls.\n\nSo to get back to your point, yes it’s the quality of the games and how we play them that makes Switch the far superior gaming device.", "Probably a bit before they realize that it is a handheld.", "What's that have to do with the question?", "Smartphone games look worse because they have to run on older and much weaker phones. If however a games was made exclusively for the iPhone 8/X it’d likely look better than switch games because they’re more powerful than the Switch.", "Idk about that honestly, but i think switch games look better because more money is put in to develop them? Tell me the answer. Right now ", ">\tvarious tests put it around the one teraflop. By comparison, the XBO, I believe, is 1.6 Teraflops (I believe the Xbox One X is rated at 6 teraflops,\n\nIt doesn’t quite work like that.\n\nThe 1Tflop for the Switch (which is actually inaccurate as thats the stock TX1, not the slower speeds the Switch runs at) is based on fp16 and the 1.6 and 6 tflops for the xboxes are in fp32.\n\nFor more accurate numbers: \n\nhandheld Switch = 0.15 tflops\n\nDocked Switch = 0.38 tflops\n\nXB1 = 1.4 tflops\n\nPS4 = 1.8 tflops\n\nPS4 Pro = 4.2 tflops\n\nXB1X = 6 tflops", "Doom not being ported to phones doesn’t mean the phone is weaker, it just means there’s no benefit for them to put in the effort to port it.", "Thanks. I won’t lie, I was mildly disappointed and even somewhat surprised to see an off-the-shelf 2015 Tegra X1 inside the Switch by the time it launched. Nvidia was talking about the Tegra X2 (codename Parker at the time) all through 2016 and had it available for purchase, at the same price as TX1, right around the time Switch launched. \n\nUnlike their previous Tegra chips, TX2 wasn’t a huge departure from TX1 and seemed to mostly smooth out some of TX1’s pain points. Namely, it brought a 2x boost in CPU performance, a 2x boost in GPU performance, double the memory bandwidth, and it pulled this all off while also lowering power draw somewhat compared to TX1. All things that would’ve directly benefitted the Switch both as a portable experience as well as a docked one. (especially that memory bandwidth boost, the real Achilles heel of the Switch as it exists today) In fact it’s so oddly similar to TX1, right down to being identical in size and pin layout for “drop in compatibility” that it almost seems like it was designed for the Switch as it doesn’t have any other application beyond a developer board to buy off of nvidia’s website. It’s possible Nvidia was asking extra for it that Nintendo decided not to pay, or perhaps yields weren’t up to what Nintendo wanted. We’ll probably never know, but a TX2 Switch would’ve been a real showstopper and could’ve closed the gap between Switch and the latest smartphones, even bringing it closer to base PS4/XB1 for ports. ", "To be fair though, most flagship phones only cost about $250-350 to make, which isn't much more than what the Switch costs to make. \n\nPhones cost that much more because people are will to spend that much more on phones, not because they're that much more expensive to actually make.", "The Odin handheld. You predicted the future", "If a developer were to specifically target the A11 chip inside iPhone 8/8+/X then yes, there is more GPU power and drastically more CPU power available than the Switch has. Realistically though, most developers are targeting the widest range of chips they can within iOS devices. They don't want to make a game that only runs on the very latest hardware, but one that can run as far back as the A7 from 2013. The A11 will run those games much better of course in terms of resolution and framerate (as long as the developer uncaps resolution/framerate from their base target, not all do even when running on better hardware), but they won't be pushing the envelope of what the hardware can do.\n\nWith the Switch, there is one single SoC that every Switch on the market has, all running at the same clockspeeds. Other than having to accommodate the halved GPU performance you get in handheld mode vs docked mode, they can push the Switch to it's limits and optimize for the best performance on just one single configuration knowing that *every* Switch will be able to achieve that same performance. With that said, if there *was* a developer crazy enough to target only the very latest iPhone hardware, they absolutely could achieve much better results than what the Switch can pump out at it's max limits. In 2-3 years we'll see developers targeting A10 or A11 as their baseline (since the future A12/A13/A14 will be in hundreds of millions of devices by then) and we'll finally see what the A11 in iPhone X is fully capable of. ", "While docked the Switch doubles it’s GPU clock speed.", "It's designed first and foremost towards playing games. Nintendo and Nvidia have worked on the tools towards making the engines and games being able to draw out all the power on the console.\n\nHowever, the iPhones and most Android phones aren't designed towards being all-purpose minicomputer devices. They're not geared towards playing games. For example, having multiple games open, a possibility on the phone systems - as they're able to maintain multiple applications open - makes it lose part of the computing power.\n\nLet's say we have a phone with the same specs as the Switch. The amount of computing power available outside the game for the phone has to be bigger than the one on the Switch as the Switch doesn't have to be able to use as many functions. There is also the thing of tinkering the game to use effectively all the power, which is something the devs can do when they only have to ensure the game works on a specific device. However, it's not the same as to making it work on multiple devices - like in the iOS, Android or even the PC spheres. PCs usually compensate that with sheerpower (that's why they can cost even more that US$2,000), whereas the iPhones/iPads and Android phones and tablets can't work as well.", "The key when comparing to phones is the thermal throttling and battery. An S8 doesn't have enough cooling to run at full power for long, but just short bursts where you might be using too many apps at once, for example. Rest of the time it will actually run at even lower clocks than the Switch does, and just scale frequencies dynamically. And, just downclock rapidly and harshly if it heats up too much, because it lacks a fan or any active cooling to rely on.\n\nWhich means that you might get to run a Switch game decently until the thing got too hot, then it would quickly start dropping frames like they are hot.\n\nAlso, good luck getting 30 minutes of playtime out of its battery.", "You want to convince me that all those people buying IPHONE X for 1000$ make money off it?\nYou are reaching here.", "I think mobile looks good. Then again I am easy to please with graphics.", "I totally agree. Phones and tablets are plenty powerful these days but touch controls are horrid. I got a Bluetooth controller though and it's awesome for running emulators. Games made for Android or iOS are still lacking though, because they're all ftp or ports of really old games. They just don't go for the market of regular console games, charging a higher price for a full modern experience (even though the technically could).  Nothing really pushes high end phones graphically because it has to run on low end phones too, which the majority of people own. PUBG mobile and maybe a couple other titles on high settings looks ok, but still not like real console games. And again, they all have shitty touch controls. Some support controllers but some don't.", "https://www.gamespot.com/articles/switch-is-a-home-console-at-heart-not-a-3ds-replac/1100-6446967", "Your the one that's saying your 1000 dollar phone is better than a 300 dollar switch", "And because you can't charge $60 for a phone game. The market is probably one of the biggest factors in the quality of games on phones.", "[deleted]", "A game looking better has nothing to do with more money being put into them It all depends on the artists and what power they have to work with", "Thanks for the correction.", "Handheld switch is 0.19 TFLOPS actually.", "I bought my phone for a phone. I bought the Switch to play games.", "So what do they mean by using a \"custom tegra chip\"?", "All that numbers are usually wrong, they don't include marketing, software development or many other things. In fact, most of mobile brands don't even make a profit so NO, they are not sold with a huge profit margin.", "Yes, but how? Is it because it's hooked to a reliable power source? ", "It isn’t doubled. ", "Of course thermals are a factor, I was just stating that the S8 is more powerful than the Switch, therefore, it actually should be able to run BotW and Odyssey, albeit for not as long as the Switch.", "The point is you CAN make a lot of money with a general purpose computing device. That’s upto the user. \n\nTell me how you’re going to make a lot of money from a switch. ", "They also said the DS wasn't a GameBoy replacement. This is all marketing.\n\nAnyway, my main point was that the Switch is a handheld because of its hardware. Just because you can plug it into a TV doesn't mean it will compete, power-wise, with devices that only have to sit beneath a TV. People hate this idea, to the point that they will come into a discussion a while after it was over to argue their shitty point.", "They didn’t say the $1000 phone was better than the $300 switch. They asked which was more powerful.\n\nNever mind the fact the S8 was $700, not $1000.", "Yeah, that’s also a huge factor too.", "They aren’t *that* limited though. You just need at least a 6s, and I was specifically talking about a game limited to just the 8/X", "PUBG and Fortnite have been capped to run on iPhone 6S hardware (A9 chip) which is has about half the performance as the latest A11 chip in iPhone 8/X and about 50% the performance of an A10 in the iPhone 7 from 2016. While the newer chips do run those games at higher levels of performance and higher resolutions, the overall fidelity of the visuals was set to be playable on the 2015 iPhones at a minimum. \n\nThe A9 chip has roughly 2x the CPU performance of the CPU inside Tegra X1 (used in Switch) and roughly the same level of GPU performance as Switch in docked mode. The difference is the iPhone has the burden of running a sophisticated operating system in the background, so games can't access quite the same potential of the chips as they can with dedicated gaming hardware such as the Switch. ", "More detailed assets cost more money to develop because more work needs to be put into them. You need to pay more artists/programmers to work more hours to make a game look better, in terms of graphical fidelity. It absolutely costs more.", "Asphalt 9 looks pretty damn good on my iPhone 8", "That’s an optional mode, the default is 0.15.", "I don't use the phone part of my phone.", "I bought my toaster to toast bread. I bought my refrigerator to store food and beverages. I bought my bed to touch myself while watching hardcore tentacle hentai.\n\nSee? We’re just stating the obvious right now.", "Well, yeah, obviously.", "Nintendo never actually used the word \"custom\" to describe their chip, they simply said it was a Tegra chip by nVidia. Although nvidia said it was [a custom chip developed over 500 man hours](https://blogs.nvidia.com/blog/2016/10/20/nintendo-switch/) which led many, including myself, to believe it was something beyond the Tegra X1.\n\nAlas, when we finally got the [first teardowns and die shots it was revealed that the silicon was absolutely identical](https://www.extremetech.com/gaming/246307-teardowns-confirm-nintendo-shield-built-standard-tegra-x1-processor) to the T210  Tegra X1 right down to the last transistor. Nintendo even uses the same \"Erista\" codename the Tegra X1 had to denote their chip in the Switch OS files. Chances are when they use the nomenclature \"custom\" they're simply referring to the fact that the chip is running at different clockspeeds from the Tegra X1 that nVidia first shipped in the 2015 Shield TV. Nintendo's X1 runs about 50% slower on the CPU (1GHz vs 2GHz) and about 30% slower on the GPU (768MHz docked vs 1GHz stock, 307MHz portable). So they weren't wrong to claim it was \"custom\" in the sense that it has adjusted speeds, but the silicon itself it utterly unchanged from what first shipped in 2015. Including the same 20nm production process that phones first used and quickly ditched in 2014 due to poor thermals and excessive power consumption, a 16nmFinFET Tegra X1 could've likely maintained stock speeds and still brought a bump in battery life. (20nm was so bad that the TX1 was their only usage of it, they stuck with 28nm for their Maxwell PC GPUs, rumor is this left them with excess 20nm contracts so they sold the TX1 chips to Nintendo for cheap to complete their contract and not pay massive penalties)\n\nNotably, there is a new SoC being referenced in the Switch OS 5.0 files that refers to \"T214\" with the name \"Marioko\" which follows the same naming scheme based on Marvel superheroes that nvidia has always used for Tegra chips (Erista for TX1, Logan for TK1, Wayne for Tegra 4, etc.) so there is something in the works related to a new chip inside a future Switch but at this point we don't know exactly what that is. \n\n", "I was speaking strictly in terms of manufacturing costs. The Switch and flagship smartphone both have roughly the same manufacturing costs, so justifying the lower performance of the Switch by saying it doesn’t cost consumers as much as a flagship smartphone is rather nonsensical.", "Yeah, it’s just because it’s plugged in. They halved the GPU’s clock speed while handheld to preserve battery life, once docked it speeds up its GPU because the battery is no longer a factor. This is why games are higher resolution while docked.", "I mean, it’s a little more than double, but not that much more.", "Sure, if we keep moving goalposts anything is possible. \n\nI don't think running a game for five minutes and then the whole thing falling apart counts as \"running a game\" in any realistic scenario. Games would still be massively unplayable.", "This discussion was never about making money of the Switch so not sure what you are talking about.\n\nAs a businessman who sells Microsoft office 365 to businesses, I think trying to justify spending grand on a phone to make money is silly, a $150 smartphone will do the same and can run all the collaboration tools for your regular businessman to make money, including email which is where most businesses deals are closed. ", "still 400 dollars more than they paid for the switch", "I think the most disappointing thing about mobile phones was how the initial apps set the expectations for the market. People all went towards $0.99 since it was the smallest amount you could charge and they wanted to seem like a good deal. Unfortunately that set an expectation that really holds things back. Even trying to charge something reasonable like $15 for a well made app is a death sentence.", "[deleted]", "TIL", "I never thought I’d have a great home and portable console in one... just think of the day when you’ll be able to have all those devices you like in one.  Convergence is bliss.", "Thank you for the detailed explanations. You've been a huge success in helping me understand the technical attributes, and where the Switch actually stands in terms of power.", "So if un-docked, yet plugged in, will it still double the GPU?", "It runs 40% less in handheld mode. 768mhz vs 307mhz. \n\nhttps://www.polygon.com/2016/12/19/14005792/nintendo-switch-docked-power-details", "I wasn’t moving any goalposts though. You asked if an S8 could run BotW and Odyssey, and I just answered your question.", "But not $1000, which would be $700 more than the Switch.", "And sadly since that’s the way the market works many really well made apps have to rely on ads or subscriptions to make ends meet.\n\nThe mobile app ecosystem would be so much better if people weren’t cheap and actually paid reasonable prices.", "Right, but I said if a game was limited to just the 8/X it’d likely look better than the Switch, and you responded talking about a game that goes all the way back to the 6s as if that was a counter argument.", "Apart from that answer being no, if it was undocked doing things like it was docked, it would generate a lot more heat which I don't think one wants when it's in their hands", "No, because that’s still considered handheld.", "it won't but it is possible that Nintendo could have done that if they wanted to but chose not to.\n\nyou're kind of thinking about it backwards, its more accurate to say that when its docked the switch runs at 100% power and when its undocked the power is cut in half to save battery life, not that anything is really being doubled. the processor always has that power available its just that half of it is turned off when its in handheld mode so it has a longer battery life.", "No because it could be plugged into a power bank and power banks don't always provide as much voltage as a standard socket.", "No, as powering the screen on the Switch is much different than outputting the signal to a TV or monitor. ", "Yes, I’m aware and, like I said, that’s not much more than double.", "I know the title of that article says 40% slower, but 307 is about 40% of 768, so we should be saying it's 60% slower.\n\nThat means the guy who said it's more than double is correct.", "I didn't ask anything, that was OP. I already know it can't, and I just told you why.\n\n¯\\\\\\_(ツ)\\_\\/¯", "Yea but if it can't run at optimal settings and definitely doesn't run as well as the switch, then technically based on the overall components, wouldn't the switch be more powerful than a phone/tablet? ", "Still 600 dollars to much to spend on a phone", "That and they would want a consistent handheld experience regardless of whether it's plugged in.", "It’s actually not doubled at all. The switch performs at 768mhz. It lowers its clock speed when undocked. It isn’t rated in handheld mode for its baseline numbers because handheld mode limits what the device can do. ", "[deleted]", "You specifically asked:\n\n>\tCan your Galaxy S8 run Breath of the Wild or Super Mario Odyssey?", "No because the factors behind the S8 having a less optimal experience are unrelated to its power. The S8 is more powerful, there’s just other factors that prevent it from having an optimal experience versus the Switch.", "Not necessarily. If you are comparing two handheld devices, the phone can compete really well, especially if it could be told to run at a slower speed to not generate too much heat just like the Switch does.", "And many would say that $300 is too much to spend on games. Turns out that different people have different values for different things. Funny how that works.", "Not only is that completely irrelevant, but you think spending more than $100 on a phone is too much?", "but is it a phone? its actually a personal computing device, the modern ones have 4k screens on them, pretty damn good cameras (not dslr level, but those tend to cost more than $1k without any of the other advantages), they can play games, run word processors, create multitrack music, they aren't far off from doing NLVE, and can already do fairly decent though feature poor image editing...  your phone is probably the single most important device you will own outside of a car or home... I love my switch and all, but lets not pretend smart phones aren't ridiculously important to our modern lives.  Hell without a smart phone I couldn't use moviepass... and I save probably $40 a month on that AT LEAST..... over the 2 year typical phone life that is $960... and as many others have said here, $1000 is the very very top end of phones out now, you can get a good recent flagship device for $600 or so, a decent high midranger (like a one plus) for about $450 and a true midranger for about $300... probably running a screen with twice the resolution of the switch's btw.\n\nAlso your overly defensive stance against people who thought $300 was too much for the switch comes , imo from a total lack of understanding of those people...  when the switch was announced and priced I know many people who reallyw anted nintendo to succeed, the $300 is too much thing was less about their own pocketbooks, and more about them wanting nintendo to be more aggressive after the failure of the wii u... it is the same reason people get annoyed when games they don't even care about keep getting announced for 3ds...  they want to the 3ds in the rearview mirror so that the focus can be on switch moving forward... they don't want nintendo or others doing anything that can be seen as an excuse for the system's failure... thankfully, the system is selling very well... just understand that many who complained about the price weren't opposed to paying it, they just were worried others wouldn't, and as such the system wouldn't be supported, and then they would get shit system support AGAIN, like they did on the wii u.", "That too ", "Now you’re just delving into useless semantics.", "You said:\n\n>\tIt runs 40% less in handheld mode.\n\n40% less than 768 is 460.8 which is 60% of 768.\n\nThe Switch runs at 40% of 768 (~307), which is 60% less.", "If something is $10 and it is 10% off, how much does it cost? Is it $9 or $1?", "Oh, that! \n\nWell, it still can't because the games aren't available on it, and because it would outright stop working after 5 minutes, which is not acceptable at all. So yeah.", "300 dollars is the average price for new consoles no way around it", "In this case, it actually does make a difference, because the default clock speed matters. A chip that runs at x speed and downclocks means that the system has a baseline thermal threshold for x. Downclocking that speed is within the thermal threshold specs for the system. \n\nThe other scenario, where a system has a baseline of x and doubles in power, means that the system now could (possibly) be running at a thermal temp that the system was never designed to handle.\n\n", "something, something, moving goal posts.", "Hence why I said “it *likely* could”", "And 600 dollars is an average price for that type of phone. Neither of these statements invalidate the fact that some will find these prices worth it while others won't.", "Which, in the context of the discussion, is useless semantics."]}