{"url": "https://www.reddit.com/r/iPhoneX/comments/8zgwjs/an_iphone_x_review_from_an_iphone_7_plus_upgrader/", "post_title": "an_iphone_x_review_from_an_iphone_7_plus_upgrader", "post_content": "At the beginning of January, due to some special circumstances, I had an opportunity to sell my iPhone 7 Plus and upgrade to a new iPhone X, SIM-free and direct from Apple Japan, with the total cost to me coming to zero. So I went ahead and did it. Usually I always keep an iPhone for at least two years. This is the first time I ever upgraded early.\n\nSome things worried me about the iPhone X (e.g. the notch and the mechanical side button). So I was somewhat wary. But since it didn’t cost me anything I took the leap and have been meaning to post a review of the iPhone X since then.\n\nThese are from notes I took since January:\n\n**No Home Button, Gestures, and FaceID vs TouchID**.\n\nAs everybody knows, the iPhone X eliminates the home button creating a display with almost no bezel – a near “full screen” experience.\n\nUntil the iPhone 7 Plus I often had home button problems because they were mechanical and wore out. With the iPhone 7 Plus the home button became a non-mechanical button with haptic feedback. I thought it was great.\n\nWith the absence of the home button in the iPhone X you must learn new “gestures” to replace what you used the home button for. And FaceID replaces the TouchID fingerprint sensor in the home button.\n\nI found learning the new gestures only took about one minute. The fact you swipe up from the bottom of the screen instead of pressing the home button, or swipe down from the top right to enter the control center is no issue at all. Those gestures are quite smooth.\n\nIn my opinion it’s also easier to return to the other open application using iPhone X gestures. The way of displaying the open apps is smoother than the double-clicking of the home button.\n\nThe really nice thing about FaceID is that it gives you an overall *smoother* interaction with the whole of iOS, and with apps which support FaceID. Here is a simple example of what I mean. Say I want to unlock my iPhone and go into my Commerce Bank account app. With the previous TouchID I need to first press the home button to wake up the iPhone, leave my finger on the home button to let my fingerprint unlock it, open the Commerce Bank app, then rest my finger on the home button again to authenticate myself to the bank.\n\nWith the iPhone X I just pick up the iPhone and say, “Hey Siri, open Commerce Bank.” Without touching *anything*, the iPhone X recognizes my face and unlocks, opens the Commerce Bank app, and that app also uses FaceID to authenticate me and log me in where I see my balance. It’s a noticeably more elegant, quick, and smooth operation.\n\nSo I would say the absence of the home button, and the *general use* of FaceID vs TouchID is clever and elegant and an improvement over the home button and fingerprint sensor method.\n\nThat said, I think the way FaceID is used with Apple Pay to confirm a payment is somewhat awkward. You are asked to double-click the mechanical button on the right side. It’s mechanical. It takes some force. It can wear out. I hope the confirmation is changed at some point to something like a force touch on the screen. However, I find this is a feature I might use once every few days compared to general use of apps, so it’s not really a big issue.\n\nOne other point is that FaceID itself isn’t flawless. You have to hold it at the right distance or it fails. So you have to get a bit used to it when using your iPhone in bed, for example. This is pretty easy to get used to though.\n\nAnother point worth mentioning is that I don’t think FaceID is as hard to fool as Apple claims. My friend, Dave, also has an iPhone X. The only thing we have in common is that we are both not-so-young white males. I am 62 now, and Dave is turning 99 tomorrow. Yet FaceID on Dave’s iPhone X recognizes me also! I think what happens is that FaceID adapts over time. So if I’m helping Dave with his iPhone X and I enter the passcode correctly often enough that FaceID starts adding data from my face to the stored face so there is some “weird hybrid face” data stored inside. Anyway, I hear from iOS 12 that families will be able to store more than one face, so this is a minor point.\n\nThe bottom line is that I do like the absence of the home button and prefer FaceID over TouchID.\n\n**The Display.**\n\nSome of you may have followed my long battle involving the iPhone 7 Plus vs the iPhone 6 Plus displays. I think the iPhone 6 Plus had a brighter and whiter display. I’m happy to report that the new OLED display on the iPhone X is noticeably brighter than the iPhone 7 Plus was. Unlike with my iPhone 7 Plus, I do not need to use the screen at full brightness, even when reading on the train. The OLED does have a blue hue when looked at at an angle, but that is a general characteristic of OLED displays and not disturbing.\n\nHowever! Please note that the *nice bright and white display* doesn’t happen by itself, using Apple’s default colors and what they call True Tone. With True Tone enabled, the display looks dingy and yellow. I honestly don’t understand Apple’s obsession with yellowish displays. If you think the iPhone X display is a bit yellow looking (the same thing applies to the iPhone 8 and iPhone 8 Plus), then I recommend turning True Tone off and adjusting the color tint in *Settings > General > Accessibility > Display Accommodations > Color Filters*. There, turn Color Filters on, choose Color Tint, set the Intensity all the way to the left, and set the Hue about 80% to the right. When you do that, the display color becomes what Apple calls “cooler” and what we ordinary people call “whiter and less yellow.”\n\nAnyway, the display is noticeably nicer than the iPhone 7 Plus, and with the settings changed I am happy with the quality and color. Sometimes I feel like I wish that whites were a bit whiter, but generally it’s a very nice display, as long as you don’t use True Tone.\n\n**The Notch.**\n\nThis feature certainly was controversial at first. As everybody knows, the iPhone X is *almost* a full display, but there is a small cut-out at the top in portrait mode for the front camera and FaceID and other sensors. Current technology still requires a non-display area for those features. I would say that 96% of the time I don’t notice the notch, or if I do it looks ok. Maybe 4% of the time it’s a little jarring, like when I open Mail, because the the background is white so the black notch area stands out.\n\nSome apps do it nicer, because they either have dark backgrounds, like the Stocks app, or the Camera app, so you don’t notice the notch at all. Some other apps will “letter box” their display area which has the equivalent appearance, just making less use of the display.\n\nIt helps to think of the display areas on either side of the notch as “*extra* display space” with extra info (time, wi-fi indicator, battery indicator, etc.) rather than thinking of the notch as  a missing area.\n\nMy overall feeling is that the notch is fine given current technology. And it’s interesting that other smart phone makers are starting to copy that design now.\n\n**The Camera.**\n\nThe camera is a slight improvement over the iPhone 7 Plus. It works a bit better in low light. The new “portrait mode” is a stand out feature, letting you create portraits easily with what seems to be studio lighting. I’ve taken some beautiful portraits using that feature. I wouldn’t upgrade from the iPhone 7 Plus to the iPhone X just for the camera improvements, but the improvements are there. Also, with the front camera you can create animated emoji which are fun to try out at least once. In the next version of iOS there will be more animated emoji features. I look forward to trying those.\n\n**The Speakers.**\n\nWhile I’m not an audiophile, I did notice that the speakers on the iPhone X are a noticeable improvement in sound quality over the iPhone 7 Plus, in volume and sound quality.\n\n**The Size.**\n\nFirst I was worried because the iPhone X is often touted as having a larger screen than the iPhone 7 Plus in a smaller body. That actually is only true *vertically*. With the elimination of the top and bottom bezel and home button, there is much more vertical screen space on the iPhone X than on the iPhone 7 Plus even though the actual size of the phone itself is much smaller. But the iPhone X is a bit *narrower*. So *overall*, it has a bit less square inches of display than the iPhone 7 Plus.\n\nThis has turned out to be a complete non-issue for me. The screen is large and fine. And when I see an iPhone 7 Plus or iPhone 8 Plus they look like unwieldy behemoths. The iPhone X has a smaller body, weighs less, yet has a taller display and almost as much total display space as the iPhone 7 Plus or iPhone 8 Plus. It’s a perfect, very convenient size for holding in my hand or putting in my pocket. My iPhone 7 Plus used to stick out of pockets and looked awkward. It’s hard to imagine wanting a larger iPhone at this point. To me, if I need a bigger display I think that’s when I would use my iPad.\n\nI know this isn’t a thorough review. I didn’t go through all the specs. The iPhone X of course has a faster processor, more RAM and more internal storage than the iPhone 7 Plus did. I just covered some of the areas of particular interest to me.\n\nOverall conclusion? I love the iPhone X!", "post_comments": ["thank you for sharing your experience about switching from 7 Plus to X \n\nI had the same experience as you when I first pre-ordered iPhone 8 Plus that I used for 2-3 Weeks then I decided to swap with iPhone X and felt better especially the premium Space Grey Stainless Steel", "Good review 👍👍"]}