{"url": "https://www.reddit.com/r/TheSilphRoad/comments/70es4i/how_long_does_an_iphone_7_plus_last_running/", "post_title": "how_long_does_an_iphone_7_plus_last_running", "post_content": "I currently have an iPhone 6s and am going to be upgrading to either the iPhone 8 or the iPhone 8 Plus. I know from looking up the specs that the 7's and 8's share the same batteries, so I'm interested to see the difference when running Pokemon Go.\n\nI've never used a Plus sized phone and actually quite like the smaller model for being able to easily hold it in my hand and get those \"one hander quitters\" ;) If the battery really is that much better on the plus though I guess it's time to learn to hold a bigger phone!\n\nAny help is much appreciated!", "post_comments": ["I have  a year old 7 and I take daily walks/bike rides of approx 3-4 miles (60-90'minutes).  Prior to a few weeks ago I would go from 100% battery down to as low as 15% while taking down 2/3 gyms, an occasional raid and capturing everything I could find.  Since then I've turned on the low power mode and it has been great.  Those same walks now result in just a 50% battery loss compared to nearly 90%.   I cannot believe it took over a year to start using that feature.  ", "I have a 7 and I've just resorted to keeping my phone on low power mode constantly so I can play for a couple hours before it dies. ", "I can't comment on the iPhone 7 but with my 7+ riding my bike to work my battery goes from 100% to about 60% in  90 minutes.  Screen on, go-tcha auto catching and spinning, taking down a few gyms on the way. ", "With my Plus I can run around in my park for 2-3 hours before I need to charge, depending on the screen brightness.", "I played 2 hours yesterday at lure party using a plus for half the time. I was at 76% and came home with 43%   iPhone 7+", "Wow looking at all these comments is crazy. I got the OnePlus 5 and run Pokémon Go, Whatsapp, Poke genie, and some other background apps - battery lasts 6 hours on a full charge. I can also split screen so I can message and play at the same time. I had a iPhone 6 before but the battery life just isn't worth going back anymore. ", "iPhone 7 Plus runs about an hour longer than iPhone 7 at the very most. The iPhone 8 Plus charge from what Apple states, is that it holds two more hours of charge beyond what the 7 Plus can handle. \n\nOnly problem I have on the 7 Plus is that it can and will get hot if you run this game and try to do tons of multitasking in the game itself. ", "I've been using low power mode on my 6s too, makes a huge difference! I honestly don't really notice a difference in my functionality either, just get that boosted battery 😄", "This seems to be pretty close to my 6s' performance, do you use low power mode at all?", "*just* 2 to 3 hours???", "I have a 7 plus and haven't really had any issues with my phone getting hot while I'm playing. What do you mean by multitasking in game? ", "I think you're mixing up the phones. Apple website states that 7+ and 8+ have exact same battery life. They do state that the X has 2 more hours than the regular 7.\n\nAdded-I came from a 6 to the 7 plus last year. Love the added battery life, am getting an additional couple of hours on it. But, like you said, much prefer the small size for holding and carrying in pocket. I'll be upgrading to the X to get the best of both worlds. ", "No but after reading the above comments I think I should give it a try.", "Yup from 100-30%. In the middle of the day with brightness at 80% and the app constantly open attached to my bicycle.  When I walk around in town, sporadically opening the phone 4hrs.  About 6 in town using PoGo+ and phone in my pocket.", "I have. It heats up pretty fast for me.  Even if I kill BG apps.  I will say it doesn't get as hot when you reduce the screen brightness obviously, but it's unavoidable during the day.", "It's called a battery pack. No need to spend 1k dollars on a phone for battery power. Lol", "It makes a huge difference, and honestly the only visible sign it's on is that your battery will be yellow!", "Somehow I expected more than this from the iPhone 7 plus...", "That could be it, I usually always have my phone brightness low whenever possible. ", "You spend money how you want. I'll spend how I want. Judgement free zone here. \nEdit--forgot to lol\nSo...lol\n", "For comparison from 100 to 0% is about 100 minutes on my iPhone 6. Low screen brightness and nothing else running. So seems good to me.", "Haha. No it's not", "As you're an iPhone user, would you like to be told \"It's called an Android phone with a removable battery plus aftermarket extended battery. No need to buy fruit phones with rubbish battery life and keep them tethered to powerbanks. Lol\"?", "Which current flagships have a removable battery anymore?", "It wouldn't bother me. It's not really worth getting emo about."]}